L1-MAIN.
   PERFORM L2-INIT.
   PERFORM L2-MAINLINE
	   UNTIL MORE-RECS = "NO".
   PERFORM L2-CLOSING.
   STOP RUN.

L2-INIT.
   OPEN INPUT BOAT-INPUT.
   OPEN OUTPUT PRTOUT.
   MOVE FUNCTION CURRENT-DATE   TO CURRENT-DATE-AND-TIME.
   MOVE CURRENT-MONTH           TO TITLE-MONTH.
   MOVE CURRENT-DAY             TO TITLE-DAY.
   MOVE CURRENT-YEAR            TO TITLE-YEAR.
   PERFORM L3-READ-INPUT.
   MOVE I-BOAT-TYPE TO H-BOAT-TYPE.
   PERFORM L5-EVAL-BOAT-TYPE.
   PERFORM L3-INIT-HEADING.

L2-MAINLINE.
   IF I-BOAT-TYPE NOT = H-BOAT-TYPE
	   PERFORM L3-MJ-SUBTOTALS
	   PERFORM L5-EVAL-BOAT-TYPE
	   WRITE PRTLINE FROM BOAT-LINE
		   AFTER ADVANCING 2 LINES
	   WRITE PRTLINE FROM SPACES.
   PERFORM L3-CALCS.
   PERFORM L3-MOVE-PRINT.
   PERFORM L3-READ-INPUT.

L2-CLOSING.
   PERFORM L3-MJ-SUBTOTALS.
   PERFORM L3-TOTALS.
   CLOSE BOAT-INPUT.
   CLOSE PRTOUT.

L3-INIT-HEADING.
   ADD 1 TO PAGE-CTR.
   MOVE PAGE-CTR                  TO TITLE-PAGE.
   WRITE PRTLINE FROM TITLE-LINE.
   WRITE PRTLINE FROM COL-HEADING1
	   AFTER ADVANCING 2 LINES.
   WRITE PRTLINE FROM COL-HEADING2
	   AFTER ADVANCING 1 LINE.
   WRITE PRTLINE FROM BOAT-LINE
	   AFTER ADVANCING 2 LINES.
   WRITE PRTLINE FROM SPACES.

L3-READ-INPUT.
   READ BOAT-INPUT
	   AT END
		   MOVE 'NO'              TO MORE-RECS.
	
L3-CALCS.
   COMPUTE C-TOTAL-COST = I-BOAT-COST + I-PREP-COST.

   COMPUTE C-MJ-NUM-SALES = C-MJ-NUM-SALES + 1.
   COMPUTE C-MJ-TOTAL-SALES = C-MJ-TOTAL-SALES + C-TOTAL-COST.

L3-MOVE-PRINT.
   EVALUATE I-ACC-PACK
	   WHEN '1'
		   MOVE 'ELECTRONICS'     TO D-ACC-PACK
	   WHEN '2'
		   MOVE 'SKI PACKAGE'     TO D-ACC-PACK
	   WHEN '3'
		   MOVE 'FISHING PACKAGE' TO D-ACC-PACK
   END-EVALUATE.
   MOVE I-LAST-NAME               TO D-LAST-NAME.
   MOVE I-STATE                   TO D-STATE.
   MOVE I-BOAT-COST               TO D-BOAT-COST.
   MOVE I-PURCHASE-DD             TO D-PURCHASE-DD.
   MOVE I-PURCHASE-MM             TO D-PURCHASE-MM.
   MOVE I-PURCHASE-YY             TO D-PURCHASE-YY.
   MOVE I-PREP-COST               TO D-PREP-COST.
   MOVE C-TOTAL-COST              TO D-TOTAL-COST.
   WRITE PRTLINE FROM DETAIL-LINE
	   AFTER ADVANCING 1 LINE
		   AT EOP
			   PERFORM L4-HEADING.
	
L3-MJ-SUBTOTALS.
   MOVE C-MJ-NUM-SALES            TO MJ-NUM-SALES.
   MOVE C-MJ-TOTAL-SALES          TO MJ-TOTAL-SALES.
   WRITE PRTLINE FROM MJ-SUBTOTAL-LINE
	   AFTER ADVANCING 2 LINES
		   AT EOP
			   PERFORM L4-HEADING.
   ADD C-MJ-NUM-SALES             TO C-GT-NUM-SALES.
   ADD C-MJ-TOTAL-SALES           TO C-GT-TOTAL-SALES.

   MOVE 0                         TO C-MJ-NUM-SALES.
   MOVE 0                         TO C-MJ-TOTAL-SALES.

   MOVE I-BOAT-TYPE               TO H-BOAT-TYPE.

L3-TOTALS.
   MOVE C-GT-NUM-SALES            TO GT-NUM-SALES.
   MOVE C-GT-TOTAL-SALES          TO GT-TOTAL-SALES.
   WRITE PRTLINE FROM TOTAL-LINE
	   AFTER ADVANCING 3 LINES.

L4-HEADING.
   ADD 1 TO PAGE-CTR.
	   MOVE PAGE-CTR              TO TITLE-PAGE.
   WRITE PRTLINE FROM TITLE-LINE
	   AFTER ADVANCING PAGE.
   WRITE PRTLINE FROM COL-HEADING1
	   AFTER ADVANCING 2 LINES.
   WRITE PRTLINE FROM COL-HEADING2
	   AFTER ADVANCING 1 LINE.
   WRITE PRTLINE FROM BOAT-LINE
	   AFTER ADVANCING 2 LINES.
   WRITE PRTLINE FROM SPACES.

L5-EVAL-BOAT-TYPE.
   EVALUATE I-BOAT-TYPE
	   WHEN 'B'
		   MOVE 'BASS BOAT'       TO COL-BOAT-TYPE
		   MOVE 'BASS BOAT'       TO MJ-BOAT-TYPE
	   WHEN 'P'
		   MOVE 'PONTOON'         TO COL-BOAT-TYPE
		   MOVE 'PONTOON'         TO MJ-BOAT-TYPE
	   WHEN 'S'
		   MOVE 'SKI BOAT'        TO COL-BOAT-TYPE
		   MOVE 'SKI BOAT'        TO MJ-BOAT-TYPE
	   WHEN 'J'
		   MOVE 'JOHN BOAT'       TO COL-BOAT-TYPE
		   MOVE 'JOHN BOAT'       TO MJ-BOAT-TYPE
	   WHEN 'C'
		   MOVE 'CANOE'           TO COL-BOAT-TYPE
		   MOVE 'CANOE'           TO MJ-BOAT-TYPE
	   WHEN 'R'
		   MOVE 'CABIN CRUISER'   TO COL-BOAT-TYPE
		   MOVE 'CABIN CRUISER'   TO MJ-BOAT-TYPE
   END-EVALUATE.
   
END PROGRAM CBLHJB03.