L1-MAIN.
    PERFORM L2-INIT.
	PERFORM L2-MAINLINE
	    UNTIL MORE-RECS = "NO".
	PERFORM L2-CLOSING.
	STOP RUN.
	
 L2-INIT.
    OPEN INPUT.
    OPEN OUTPUT.
    MOVE FUNCTION CURRENT-DATE  TO CURRENT-DATE-AND-TIME.
    MOVE CURRENT-MONTH          TO TITLE-MONTH.
    MOVE CURRENT-DAY            TO TITLE-DAY.
    MOVE CURRENT-YEAR           TO TITLE-YEAR.
	PERFORM L3-INIT-HEADING.
	PERFORM L3-READ-INPUT.
	
L2-MAINLINE.
    PERFORM L3-CALCS.
    PERFORM L3-MOVE-PRINT.
    PERFORM L3-READ-INPUT.

L2-CLOSING.
    PERFORM L3-TOTALS.
    CLOSE INPUT.
    CLOSE PRTOUT.

L3-INIT-HEADING.
    ADD 1 TO PAGE-CTR.
    MOVE PAGE-CTR               TO TITLE-PAGE.
    WRITE PRTLINE FROM TITLE-LINE1.
	WRITE PRTLINE FROM TITLE-LINE2
		AFTER ADVANCING 1 LINE.
    WRITE PRTLINE FROM COL-HEADING1
	    AFTER ADVANCING 2 LINES.
    WRITE PRTLINE FROM COL-HEADING2
	    AFTER ADVANCING 1 LINE.
	

L3-READ-INPUT.
    READ INPUT
	    AT END
		    MOVE 'NO' TO MORE-RECS.
			
L3-CALCS.
	
	
	EVALUATE I-UNIT
		WHEN 1 THRU 8
			COMPUTE ROUNDED C-BASE-RATE = 650
			IF I-TENANTS 2 THRU 3
				MOVE 25 T0 C-TENANT-CHARGE
			ELSE
				IF I-TENANTS >= 4
					MOVE 83.45 TO C-TENANT-CHARGE
				END-IF
			END-IF
		WHEN 9 THRU 16
			COMPUTE ROUNDED C-BASE-RATE = 700
			IF I-TENANTS 2 THRU 3
				MOVE 35.55 T0 C-TENANT-CHARGE
			ELSE
				IF I-TENANTS >= 4
					MOVE 135 TO C-TENANT-CHARGE
				END-IF
			END-IF
		WHEN 17 THRU 25
			COMPUTE ROUNDED C-BASE-RATE = 825
			IF I-TENANTS 2 THRU 3
				MOVE 50 T0 C-TENANT-CHARGE
			ELSE
				IF I-TENANTS >= 4
					MOVE 185.60 TO C-TENANT-CHARGE
				END-IF
			END-IF
	END EVALUATE.
	
	EVALUATE I-BLD-CODE
		WHEN 'AA'
			MOVE 'PALACE PLACE' TO O-BLD
		WHEN 'GG'
			MOVE 'GEORIGA' TO O-BLD
		WHEN 'PP'
			MOVE 'PARK PLACE' TO O-BLD
			IF I-UNIT = 23 0R I-UNIT 25
				COMPUTE ROUNDED C-PREM-DISC = C-BASE-RATE * 0.12
				ADD 1 TO C-GT-PREM-CTR
		WHEN 'IA'
			MOVE 'IOWA CONDO' TO O-BLD
			IF CURRENT-MONTH = 7 OR CURRENT-MONTH = 12
				COMPUTE ROUNDED C-PREM-DISC = (C-BASE-RATE * 0.5) * -1
				ADD 1 TO C-GT-DISC-CTR
			END-IF
		WHEN 'MS'
			MOVE 'MARKET STREET' TO O-BLD
		WHEN 'HH'
			MOVE 'HIGH TOWER' TO O-BLD
		WHEN 'R7'
			MOVE 'UPTOWN CONDOS' TO O-BLD
			IF I-UNIT = 23 0R I-UNIT 25
				COMPUTE ROUNDED C-PREM-DISC = C-BASE-RATE * 0.12
				ADD 1 TO C-GT-PREM-CTR
		WHEN 'GM'
			MOVE 'GANDER MOUNTAIN' TO O-BLD
		WHEN 'BP'
			MOVE 'BENTON PLACE' TO O-BLD
			COMPUTE ROUNDED C-PREM-DISC = (C-BASE-RATE * 0.33) * -1
			ADD 1 TO C-GT-DISC-CTR
		WHEN 'GA'
			MOVE 'GRAND AVENUE' TO O-BLD
		WHEN 'JK'
			MOVE 'JACKS PLACE' TO O-BLD
			IF CURRENT-MONTH = 7 OR CURRENT-MONTH = 12
				COMPUTE ROUNDED C-PREM-DISC = (C-BASE-RATE * 0.5) * -1
				ADD 1 TO C-GT-DISC-CTR
			END-IF
		WHEN 'UN'
			MOVE 'UNDERGROUND SAM' TO O-BLD
		WHEN 'YD'
			MOVE 'YANKEE DOODLE' TO O-BLD
		WHEN 'YT'
			MOVE 'YAHTZEE AVE' TO O-BLD
			IF I-UNIT = 23 0R I-UNIT 25
				COMPUTE ROUNDED C-PREM-DISC = C-BASE-RATE * 0.12
				ADD 1 TO C-GT-PREM-CTR
		WHEN 'CP'
			MOVE 'COURT PLACE' TO O-BLD
		WHEN 'NZ'
			MOVE 'NEW ZOO' TO O-BLD
		WHEN 'VV'
			MOVE 'VERMONT' TO O-BLD
		WHEN 'CT'
			MOVE 'CHINA TOWN' TO O-BLD
			COMPUTE ROUNDED C-PREM-DISC = (C-BASE-RATE * 0.33) * -1
			ADD 1 TO C-GT-DISC-CTR
		WHEN 'YS'
			MOVE 'YORKSHIRE' TO O-BLD
		WHEN 'ME'
			MOVE 'MAINE APT' TO O-BLD
	END-EVALUATE.
	
	COMPUTE ROUNDED C-SUBTOTAL = C-TENANT-CHARGE + C-BASE-RATE.
	COMPUTE ROUNDED C-TOTAL-UTIL-COST = C-ELECTRIC-COST + C-GAS-COST + C-WATER-COST + C+GARBAGE-COST.
	COMPUTE ROUNDED C-RENT-DUE = C-TOTAL-UTIL-COST + C-SUBTOTAL.
	
L3-MOVE-PRINT.
	MOVE I AND C FIELDS TO D FIELDS.
	WRITE PRTLINE FROM DETAIL-LINE
	    AFTER ADVANCING 2 LINES
		    AT EOP
		        PERFORM L4-HEADING.
			
L3-TOTALS.
	MOVE C-GT FIELDS TO GT FIELDS.
	WRITE PRTLINE FROM TOTAL-LINE
		AFTER ADVANCING 3 LINES.
	WRITE PRTLINE FROM TOTAL-LINE2
		AFTER ADVANCING 2 LINES.
	WRITE PRTLINE FROM TOTAL-LINE3
		AFTER ADVANCING 1 LINE.

L4-HEADING.
	ADD 1 TO PAGE-CTR.
	   MOVE PAGE-CTR               TO TITLE-PAGE.
	   WRITE PRTLINE FROM TITLE-LINE1
		   AFTER ADVANCING PAGE.
	   WRITE PRTLINE FROM TITLE-LINE2
	       AFTER ADVANCING 1 LINE.
	   WRITE PRTLINE FROM COL-HEADING1
		   AFTER ADVANCING 2 LINES.
	   WRITE PRTLINE FROM COL-HEADING2
		   AFTER ADVANCING 1 LINE.
	   