l1 MAIN
	PERFORM L2-INIT
	PERFORM L2-MAINLINE
	UNTIL MORE-RECS = 'NO'

L2 INIT
	OPEN INPUT STUDENT-MASTER
	OPEN OUTPUT PRTOUT
	GET SYSTEM DATE
	MOVE SYSTEM-MO TO TITLE-MONTH
	MOVE SYSTEM-DAY TO TITLE-DAY
	MOVE SYSTEM YEAR TO TITLE-YEAR
	CALL L3 HEADING
	
L3 HEADING
	PAGE-CTR += 1
	MOVE PAGE-CTR TO TITLE PAGE-CTR
	PRINT TITLE LINE
	PRINT BLANK LINE
	PRINT COL-HEADING1
	PRINT COL-HEADING2
	PRINT BLANK LINE