	   L1-MAIN.
		   PERFORM L2-INIT.
		   PERFORM L2-MAINLINE
			   UNTIL MORE-RECS = "NO".
		   PERFORM L2-CLOSING.
           STOP RUN.

	   L2-INIT.
		   OPEN INPUT
		   OPEN OUTPUT
		   MOVE FUNCTION CURRENT-DATE  TO CURRENT-DATE-AND-TIME.
		   MOVE CURRENT-MONTH          TO TITLE-MONTH.
		   MOVE CURRENT-DAY            TO TITLE-DAY.
		   MOVE CURRENT-YEAR           TO TITLE-YEAR.
		   PERFORM L4-HEADING.
		   PERFORM L3-READ-INPUT.

	   L2-MAINLINE.
		   PERFORM L3-CALCS.
		   PERFORM L3-MOVE-PRINT.
		   PERFORM L3-READ-INPUT.

	   L2-CLOSING.
		   PERFORM L3-TOTALS.
		   CLOSE INPUT
		   CLOSE OUTPUT

       L3-READ-INPUT.
		   READ INPUT
			   AT END
				   MOVE 'NO' TO MORE-RECS.

	   L3-CALCS.

	   L3-MOVE-PRINT.
		   WRITE PRTLINE FROM DETAIL-LINE
			   AFTER ADVANCING 2 LINES
				   AT EOP
					   PERFORM L4-HEADING.

	   L3-TOTALS.
		   MOVE C-STUD-CTR             TO T-TOTAL-COUNT.
		   WRITE PRTLINE FROM TOTAL-LINE
			   AFTER ADVANCING 3 LINES.

	   L4-HEADING.
		   ADD 1 TO PAGE-CTR.
		   MOVE PAGE-CTR               TO TITLE-PAGE.
		   WRITE PRTLINE FROM TITLE-LINE
			   AFTER ADVANCING PAGE.
		   WRITE PRTLINE FROM COL-HEADING1
			   AFTER ADVANCING 2 LINES.
		   WRITE PRTLINE FROM COL-HEADING2
			   AFTER ADVANCING 1 LINE.
      *THIS WOULD BE NECESSARY IF DETAIL LINE WAS SINGLE SPACED. 
      *WRITE PRTLINE FROM SPACES
      *AFTER ADVANCING 1 LINE.