       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBLHJB04.
	   AUTHOR. HARRISON BIRKNER.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
	   FILE SECTION.
	 
       WORKING-STORAGE SECTION.
	   
       PROCEDURE DIVISION.
	  
           STOP RUN.

       END PROGRAM CBLHJB04.