IF CARD-CODE = 'A' OR CARD-CODE = 'B' OR CARD-CODE = 'C'
	IF CARD-CODE = 'A'
		ADD CARD-AMT TO A-CTR
		PERFORM WRITE
	ELSE
		IF CARD-CODE = 'B'
			ADD 1 TO B-CTR
		ELSE
			ADD 1 TO C-CTR
		END-IF
	END-IF
ELSE
	MOVE 'CARD CODE INVALID' TO CODE-ERROR
	PERFORM ERROR
END-IF.