01 ERR-SW 			PIC X				VALUE ‘Y’.
01 O-ERR-MSG		PIC X(40).
01 PUR-REC.
	05 PUR-UPC		PIC X(5).  
	05 PUR-UOM		PIC XX.
		88 VAL-UOM						VALUE 'EA', 'DZ', 'LB', 'OZ'.
	05 PUR-COST		PIC 9(3)V99.  
    05 PUR-QTY		PIC S99.
		88 VAL-QTY						VALUE 1 THRU 50.
2000-MAINLINE
	PERFORM 2100-VALIDATION
		THRU 2100-VALIDATION-EXIT.
	IF ERR-SW = 'Y'
		PERFORM 2100-ERR-RTN
	ELSE
		PERFORM 2100-CALCS
		PERFORM 2100-OUTPUT.
	PERFORM 2100-READ.
2100-VALIDATION.
	MOVE 'N' TO ERR-SW.
	IF PUR-UPC NOT ALPHABETIC
		MOVE 'Y'TO ERR-SW
		MOVE 'UPC NOT LETTERS OR SPACES' TO O-ERR-MSG
		GO TO 2100-VALIDATION-EXIT.
	IF NOT VAL-UOM
		MOVE 'Y' TO ERR-SW
		MOVE 'UOM NOT EA, DZ, LB, OZ' TO O-ERR-MSG
		GO TO 2100-VALIDATION-EXIT.
	IF PUR-COST NUMERIC
		IF PUR-COST > 0
			NEXT SENTENCE
		ELSE
			MOVE 'Y' TO ERR-SW
			MOVE 'PURCHASE COST NOT GREATER THAN ZERO' TO O-ERR-MSG
			GO TO 2100-VALIDATION-EXIT
		END-IF
	ELSE
		MOVE 'Y' TO ERR-SW
		MOVE 'PURCHASE COST NOT NUMERIC' TO O-ERR-MSG
		GO TO 2100-VALIDATION-EXIT.
	IF PUR-QTY NUMERIC
		IF VAL-QTY
			NEXT SENTENCE
		ELSE
			MOVE 'Y' TO ERR-SW
			MOVE 'QUANTITY NOT 1 THROUGH 50' TO O-ERR-MSG
			GO TO 2100-VALIDATION-EXIT
		END-IF
	ELSE
		MOVE 'Y' TO ERR-SW
		MOVE 'QUANTITY NOT NUMERIC' TO O-ERR-MSG
		GO TO 2100-VALIDATION-EXIT.
	
2100-VALIDATION-EXIT.
	EXIT.