IF A = B
	IF C = D
		MOVE 1 TO X
	ELSE
		MOVE 2 TO X
	END-IF
	MOVE 3 TO Y
ELSE
	MOVE 1 TO X
	IF E NOT EQUAL F
		MOVE X TO PR-X.
WRITE DETAIL-LINE.
IF PR-X = 1
	WRITE ERR-LINE.