       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBLHJB02.
	   AUTHOR. HARRISON BIRKNER.

       ENVIRONMENT DIVISION.
       DATA DIVISION.

       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.

           STOP RUN.
           
       END PROGRAM CBLHJB02.