       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBLHJB01.
	   AUTHOR. HARRISON BIRKNER.
	   

       ENVIRONMENT DIVISION.
		   SELECT PIZZA-INPUT
			   ASSIGN TO 'C:\COBOLWI19\CBLPIZZA.DAT'
				   ORGANIZATION IS LINE SEQUENTIAL.

		   SELECT PRTOUT
		       ASSIGN TO 'C:\COBOLWI19\PIZZARPT.PRT'
				   ORGANIZATION IS RECORD SEQUENTIAL.

       DATA DIVISION.
	   FILE SECTION.
	   FD PIZZA-INPUT
		   LABEL RECORD IS STANDARD
		   DATA RECORD IS I-PIZZA-REC
		   RECORD CONTAINS 26 CHARACTERS.

	   01 I-PIZZA-REC.
		   05 I-PIZZA-ITEM-NO.
			  10 I-PIZZA-ITEM-NO1     PIC X.
			  10 I-PIZZA-ITEM-NO2     PIC X.
			  10 I-PIZZA-ITEM-NO3     PIC XX.
		   05 I-PIZZA-CUR-DATE.
			  10 I-PIZZA-CUR-YY       PIC 9(4).
			  10 I-PIZZA-CUR-MM       PIC 99.
			  10 I-PIZZA-CUR-DD       PIC 99.
		   05 I-PIZZA-PRICE           PIC 99V99.
		   05 I-PIZZA-CUR-QTY         PIC 9(5).
		   05 I-PIZZA-PREV-QTY        PIC 9(5).

	   FD PRTOUT
		   LABEL RECORD IS OMITTED
		   DATA RECORD IS PRTLINE
		   RECORD CONTAINS 132 CHARACTERS
		   LINAGE IS 60 WITH FOOTING AT 56.

	   01 PRTLINE                     PIC X(132).           
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.

           STOP RUN.
           
       END PROGRAM CBLHJB01.