	   L1-MAIN.
		   PERFORM L2-INIT.
		   PERFORM L2-MAINLINE
			   UNTIL MORE-RECS = "NO".
		   PERFORM L2-CLOSING.
           STOP RUN.

	   L2-INIT.
		   OPEN INPUT
		   OPEN OUTPUT
		   MOVE FUNCTION CURRENT-DATE  TO CURRENT-DATE-AND-TIME.
		   MOVE CURRENT-MONTH          TO TITLE-MONTH.
		   MOVE CURRENT-DAY            TO TITLE-DAY.
		   MOVE CURRENT-YEAR           TO TITLE-YEAR.
		   PERFORM L4-HEADING.
		   PERFORM L3-READ-INPUT.

	   L2-MAINLINE.
		   PERFORM L3-CALCS.
		   PERFORM L3-MOVE-PRINT.
		   PERFORM L3-READ-INPUT.

	   L2-CLOSING.
		   PERFORM L3-TOTALS.
		   CLOSE INPUT
		   CLOSE OUTPUT

       L3-READ-INPUT.
		   READ INPUT
			   AT END
				   MOVE 'NO' TO MORE-RECS.

	   L3-CALCS.
		   C-SALES-INCDEC = PIZZA-CUR-QTY - PIZZA-PREV-QTY.
		   C-INCDEC-PERC = C-SALES-INCDEC / PIZZA-PREV-QTY.
		   C-TOTAL-SALES = PIZZA-PRICE * PIZZA-CUR-QTY.
		   C-TOTAL-SALES-TOTAL = C-TOTAL-SALES-TOTAL + C-TOTAL-SALES.
		   C-SALES-INCDEC-TOTAL = C-SALES-INCDEC-TOTAL + C-SALES-INCDEC.
		   C-NUM-SALES = C-NUM-SALES + 1.
		   C-PREV-QTY-TOTAL = C-PREV-QTY-TOTAL + PIZZA-PREV-QTY.

	   L3-MOVE-PRINT.
		   WRITE PRTLINE FROM DETAIL-LINE
			   AFTER ADVANCING 2 LINES
				   AT EOP
					   PERFORM L4-HEADING.

	   L3-TOTALS.
		   C-AVG-INCDEC = C-SALES-INCDEC-TOTAL / C-NUM-SALES.
		   C-AVG-INCDEC-PERC = C-SALES-INCDEC-TOTAL / C-PREV-QTY-TOTAL.
		   WRITE PRTLINE FROM TOTAL-LINE1
			   AFTER ADVANCING 4 LINES.
		   WRITE PRTLINE FROM TOTAL-LINE2
			   AFTER ADVANCING 2 LINES.
		   WRITE PRTLINE FROM TOTAL-LINE3
			   AFTER ADVANCING 2 LINES.

	   L4-HEADING.
		   ADD 1 TO PAGE-CTR.
		   MOVE PAGE-CTR               TO TITLE-PAGE.
		   WRITE PRTLINE FROM TITLE-LINE
			   AFTER ADVANCING PAGE.
		   WRITE PRTLINE FROM COL-HEADING1
			   AFTER ADVANCING 2 LINES.
		   WRITE PRTLINE FROM COL-HEADING2
			   AFTER ADVANCING 1 LINE.
      *THIS WOULD BE NECESSARY IF DETAIL LINE WAS SINGLE SPACED. 
      *WRITE PRTLINE FROM SPACES
      *AFTER ADVANCING 1 LINE.