 L1-MAIN.
     PERFORM L2-INIT.
     PERFORM L2-MAINLINE
         UNTIL MORE-RECS = "NO".
     PERFORM L2-CLOSING.
 STOP RUN.
 
 L2-INIT.
     OPEN INPUT POP-INPUT.
     OPEN OUTPUT PRTOUT.
	 OPEN OUTPUT ERROUT.
     MOVE FUNCTION CURRENT-DATE        TO CURRENT-DATE-AND-TIME.
     MOVE CURRENT-MONTH                TO TITLE-MONTH.
     MOVE CURRENT-DAY                  TO TITLE-DAY.
     MOVE CURRENT-YEAR                 TO TITLE-YEAR.
     
     PERFORM L3-INIT-HEADING.
     PERFORM L9-READ-INPUT.

 L2-MAINLINE.
	PERFORM L3-VALIDATION
		THRU L3-VALIDATION-EXIT.
	IF ERROR-SW = 'N'
		PERFORM L3-CALC
		PERFORM L3-MOVE-PRINT
	ELSE
		PERFORM L3-ERROR.
	PERFORM L3-READ.
 
 L2-CLOSING.
     PERFORM L3-TOTALS.
     CLOSE POP-INPUT.
     CLOSE PRTOUT.
	 CLOSE ERROUT.

 L3-INIT-HEADING.
*THIS PARAGRAPH FUNCTIONS THE SAME AS L4-HEADING, EXCEPT IT IS
*ONLY RUN ONCE AT THE BEGINNING OF THE PROGRAM AND DOES NOT PRINT
*AN EXTRA 60 BLANK LINES.
     ADD 1                             TO PAGE-CTR.
     MOVE PAGE-CTR                     TO TITLE-PAGE.
     WRITE PRTLINE FROM TITLE-LINE1.
     WRITE PRTLINE FROM TITLE-LINE2
       AFTER ADVANCING 1 LINE.
     WRITE PRTLINE FROM COL-HEADING1
         AFTER ADVANCING 2 LINES.
     WRITE PRTLINE FROM COL-HEADING2
         AFTER ADVANCING 1 LINE.
	
 L3-VALIDATION.
	MOVE 'N' TO ERROR-SW.
	IF L-NAME EQUAL SPACES
		MOVE 'LAST NAME REQUIRED' TO ERROR-MSG
		MOVE 'Y' TO ERROR-SW
		GO TO L3-VALIDATION-EXIT.
	IF NOT VAL-STATES
		MOVE 'STATES MUST BE IA, IL, MI, MO, NE, OR WI' TO ERROR-MSG
		MOVE 'Y' TO ERROR-SW
		GO TO L3-VALIDATION-EXIT.
	IF I-ZIP NOT NUMERIC
		MOVE 'ZIP CODE MUST BE NUMERIC' TO ERROR-MSG
		MOVE 'Y' TO ERROR-SW
		GO TO L3-VALIDATION-EXIT.
	IF I-POP-TYPE NUMERIC
		IF NOT VAL-POP-TYPES
			NEXT SENTENCE
		ELSE
			MOVE 'POP TYPE MUST BE 1-6' TO ERROR-MSG
			MOVE 'Y' TO ERROR-SW
			GO TO L3-VALIDATION-EXIT.
		END-IF.
	ELSE
		MOVE 'POP TYPE MUST BE NUMERIC' TO ERROR-MSG
			MOVE 'Y' TO ERROR-SW
			GO TO L3-VALIDATION-EXIT.
			
 L3-VALIDATION-EXIT.
	EXIT.
	
 L3-ERROR.
	COMPUTE ERR-CTR = ERR-CTR + 1.
	MOVE I-REC TO O-ERR-REC
	WRITE ERRLINE FROM O-ERROR-LINE
		AFTER ADVANCING 2 LINES
			AT EOP
				PERFORM L4-ERROR-HEADINGS
 L3-CALCS.
	EVALUATE I-STATE
		WHEN 'IA'
			MOVE 0.05 TO DEP
	END-EVALUATE.
	COMPUTE TOT-DEP = DEP * (24 * I-CASES).
	COMPUTE TOT-AMNT = (18.71 * I-CASES) + TOT-DEP.
	
 L3-MOVE-PRINT.
*    MOVE I AND C FIELDS TO D FIELDS.  

     WRITE PRTLINE FROM DETAIL-LINE
         AFTER ADVANCING 2 LINES
             AT EOP
                 PERFORM L4-HEADING.
      
 L3-TOTALS.
*	 MOVE C-GT FIELDS TO GT FIELDS.
	 WRITE PRTLINE FROM TITLE-LINE1
		AFTER ADVANCING PAGE.
	 WRITE PRTLINE FROM TITLE-LINE2
        AFTER ADVANCING 1 LINE.
	 WRITE PRTLINE FROM TITLE-LINE3
		AFTER ADVANCING 1 LINE.
     WRITE PRTLINE FROM GT-POP-LINE
		AFTER ADVANCING 2 LINES.
     WRITE PRTLINE FROM GT-POP-LINE2
        AFTER ADVANCING 2 LINES.
*	 MOVE NEXT C-GT FIELDS.
	 WRITE PRTLINE FROM GT-POP-LINE2
        AFTER ADVANCING 2 LINES.
		
	 WRITE PRTLINE FROM GT-TEAM-LINE
		AFTER ADVANCING 3 LINES.
*	 MOVE NEXT C-GT FIELDS.
	 WRITE PRTLINE FROM GT-TEAM-LINE2
		AFTER ADVANCING 2 LINES.
*	 MOVE NEXT C-GT FIELDS.
	 WRITE PRTLINE FROM GT-TEAM-LINE2
		AFTER ADVANCING 2 LINES.
*	 MOVE NEXT C-GT FIELDS.
	 WRITE PRTLINE FROM GT-TEAM-LINE2
		AFTER ADVANCING 2 LINES.
*	 MOVE NEXT C-GT FIELDS.
	 WRITE PRTLINE FROM GT-TEAM-LINE2
		AFTER ADVANCING 2 LINES.
*	 MOVE NEXT C-GT FIELDS.
	 WRITE PRTLINE FROM GT-TEAM-LINE2
		AFTER ADVANCING 2 LINES.


 L4-HEADING.
     ADD 1 TO PAGE-CTR.
     MOVE PAGE-CTR TO TITLE-PAGE.
     WRITE PRTLINE FROM TITLE-LINE1
         AFTER ADVANCING PAGE.
     WRITE PRTLINE FROM TITLE-LINE2
         AFTER ADVANCING 1 LINE.
	 WRITE PRTLINE FROM TITLE-LINE3
		 AFTER ADVANCING 1 LINE.
     WRITE PRTLINE FROM COL-HEADING1
         AFTER ADVANCING 2 LINES.
     WRITE PRTLINE FROM COL-HEADING2
         AFTER ADVANCING 1 LINE.
 
 L9-READ-INPUT.
     READ POP-INPUT
         AT END
             MOVE 'NO' TO MORE-RECS.